01  WS-AMOUNT PIC 9(7)V99 VALUE ZEROES.

     * ... some COBOL code ...

     ADD 123.45 TO WS-AMOUNT.
     DISPLAY WS-AMOUNT.

     ADD 567.89 TO WS-AMOUNT.
     DISPLAY WS-AMOUNT.